/* 
Направете програма, в която дефинирайте макро - функция, която приема два аргумента (A и B) и да намира колко е резултата от (A + B) ^ 2.
Демонстрирайте използването на това макро в main функцията. Изпълнете стъпката на препроцесинг за тази програма и качете резултата от нея в отделен файл към заданието.
*/
#include <stdio.h>
#define SQUARE(A, B) ((A) + (B)) * ((A) + (B))
 int main() {
     int a = 5;
     int b = 6;
     int result = SQUARE(a, b);
     printf("%d\n", result);
     return 0;
 }