/*
Направете програма, която да намира най-малко общо кратно на две числа.
Пример: a=12, б=18, най-малко общо кратно = 36.
Изпълнете първите две стъпки от процеса на компилация на тази програма и качете асембли кода заедно със задачата към заданието.
*/
#include <stdio.h>

int main() {
    printf("Enter two numbers: ");
    int a, b;
    scanf("%d %d", &a, &b);
    int result = 0;
    int i = 1;
    while (i <= a * b) {
        if (i % a == 0 && i % b == 0) {
            result = i;
            break;
        }
        i++;
    }
    printf("%d\n", result);
    return 0;
}