/*
Направете файл maths.h в който е декларирана функция, която да намира факториел-а на дадено число. 
Направете файл maths.c, който да имплементира функцията (да я дефинира). 
Направете програма main.c, която да вмъква заглавния файл и да демонстрира работата на функцията. 
Превърнете maths.c в статична библиотека и свържете библиотеката при компилацията на main.c. 
Запишете командите по създаване на библиотеката и компилацията на програмата в отделен файл и го прикачете към заданието
*/

#include <stdio.h>
#include "maths.h"

int main() {
    int num = 5;
    printf("Factorial of %d is %lld\n", num, factorial(num));
    
    return 0;
}